bookstore_app/app/views/novels/new.html.erb

SELECT `genres`.* FROM `genres`
---
<%= f.label :genre %><br />
<%= f.select :genre_id, Genre.all.collect {|x| [x.name,
x.id]}, {:include_blank => 'Select Genre'},class:'form-control'

SELECT `publishers`.* FROM `publishers`
---
<%= f.label :publisher %><br />
<%= f.select :publisher_id, Publisher.all.collect {|x| [x.name,
x.id]}, {:include_blank => 'Select Publisher'},class:'form-control'