bookstore_app/app/controllers/authors_controller.rb

    def index
    @authors=Author.all
---
SELECT `authors`.* FROM `authors`

    def show
    @author=Author.find(params[:id])
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1

    def create
    @author=Author.new(author_params)
    if @author.save
---
INSERT INTO `authors` (`fname`, `lname`, `bio`, `created_at`, `updated_at`) VALUES ('Dave', 'DAve', 'Daa', '2021-02-02 15:33:28.081921', '2021-02-02 15:33:28.081921')