bookstore_app/app/controllers/books_controller.rb

    def create
    @book=Book.new(book_params)
    @book.save
---
INSERT INTO `books` (`title`, `price`, `book_id`, `publisher`, `description`, `number`, `created_at`, `updated_at`) VALUES ('g3', 3.0, 'g', 'd', 'd', 1, '2021-01-26 14:51:43.414153', '2021-01-26 14:51:43.414153')