bookstore_app/app/controllers/genres_controller.rb

    def index
    @genres=Genre.all
---
SELECT `genres`.* FROM `genres`

    def create
    @genre=Genre.new(genre_params)
    if @genre.save
---
INSERT INTO `genres` (`name`, `created_at`, `updated_at`) VALUES ('Tesa', '2021-02-02 15:59:04.477563', '2021-02-02 15:59:04.477563')