bookstore_app/app/controllers/novels_controller.rb

SELECT `novels`.* FROM `novels`
---
    def index
    @novels=Novel.all

SELECT `novels`.* FROM `novels` WHERE `novels`.`id` = 1 LIMIT 1
---
    def show
    @novel=Novel.find(params[:id])

INSERT INTO `novels` (`title`, `genre_id`, `author_id`, `publisher_id`, `isbn`, `price`, `publication`, `format`, `description`, `created_at`, `updated_at`) VALUES ('tt', 1, 1, 1, '', 4.0, '2021-02-04', '', '', '2021-02-09 15:42:44.993570', '2021-02-09 15:42:44.993570')
---
    def create
        @novel=Novel.new(novel_params)
        if @novel.save