bookstore_app/app/controllers/publishers_controller.rb

SELECT `publishers`.* FROM `publishers`
---
      def index
      @publishers=Publisher.all

SELECT `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 1 LIMIT 1
---
      def show
      @publisher=Publisher.find(params[:id])

INSERT INTO `publishers` (`name`, `country`, `created_at`, `updated_at`) VALUES ('Dav', 'UK', '2021-02-02 15:59:12.250659', '2021-02-02 15:59:12.250659')
---
      def create
      @publisher=Publisher.new(publisher_params)
      if @publisher.save