bookstore_app/app/controllers/users_controller.rb

    def create
    @user=User.new(user_params)
    @user.save
---
INSERT INTO `users` (`fullname`, `email`, `user_id`, `created_at`, `updated_at`) VALUES ('h', '', '', '2021-01-27 16:11:41.870282', '2021-01-27 16:11:41.870282')